In [1]:
import pandas as pd

In [2]:
from sqlalchemy import create_engine, func
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String, Float, DateTime, Date, Time
from sqlalchemy.orm import Session

In [3]:
import datetime as dt

In [102]:
# Sets an object to utilize the default declarative base in SQL Alchemy
Base = declarative_base()

In [103]:
# Creates Classes which will serve as the anchor points for our Table
class SP_Data_V2(Base):
    __tablename__ = 'sp_data_v2'
    id = Column(Integer, primary_key=True)
    date = Column(Date)
    open = Column(Float)
    high = Column(Float)
    low = Column(Float)
    close = Column(Float)
    adj_close = Column(Float)
    volume = Column(Integer)

In [104]:
# Create Database Connection
engine = create_engine("sqlite:///../../db/bulls_bears.sqlite")
conn = engine.connect()

In [105]:
# Create a "Metadata" Layer That Abstracts our SQL Database
# ----------------------------------
# Create (if not already in existence) the tables associated with our classes.
Base.metadata.create_all(engine)

In [98]:
# Use this to clear out the db
# ----------------------------------
Base.metadata.drop_all(engine)
Base.metadata.clear()

In [99]:
from sqlalchemy import inspect

In [120]:
# Create the inspector and connect it to the engine
inspector = inspect(engine)

In [121]:
# Collect the names of tables within the database
inspector.get_table_names()

['sp_data', 'sp_data_v2']

In [122]:
# Using the inspector to print the column names within the 'tweet_data' table and its types
columns = inspector.get_columns('sp_data_v2')
for column in columns:
    print(column["name"], column["type"])

id INTEGER
date DATE
open FLOAT
high FLOAT
low FLOAT
close FLOAT
adj_close FLOAT
volume INTEGER

In [109]:
data_file = "../../datasets/SAP500_updated.csv"

In [110]:
sp_df = pd.read_csv(data_file)

In [111]:
sp_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2000-01-03,1469.250000,1478.000000,1438.359985,1455.219971,1455.219971,931800000
1,2000-01-04,1455.219971,1455.219971,1397.430054,1399.420044,1399.420044,1009000000
2,2000-01-05,1399.420044,1413.270020,1377.680054,1402.109985,1402.109985,1085500000
3,2000-01-06,1402.109985,1411.900024,1392.099976,1403.449951,1403.449951,1092300000
4,2000-01-07,1403.449951,1441.469971,1400.729980,1441.469971,1441.469971,1225200000

In [112]:
sp_df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [113]:
sp_df["Date"] = sp_df["Date"].apply(lambda x: dt.datetime.strptime(x, "%Y-%m-%d").date())

In [114]:
sp_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2000-01-03,1469.250000,1478.000000,1438.359985,1455.219971,1455.219971,931800000
1,2000-01-04,1455.219971,1455.219971,1397.430054,1399.420044,1399.420044,1009000000
2,2000-01-05,1399.420044,1413.270020,1377.680054,1402.109985,1402.109985,1085500000
3,2000-01-06,1402.109985,1411.900024,1392.099976,1403.449951,1403.449951,1092300000
4,2000-01-07,1403.449951,1441.469971,1400.729980,1441.469971,1441.469971,1225200000

In [115]:
sp_df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [116]:
sp_df = sp_df.rename(columns={"Date": "date", "Open": "open", "High": "high",
                              "Low": "low", "Close": "close",
                              "Adj Close": "adj_close", "Volume": "volume"})

In [117]:
#Export data to sqlite
sp_df.to_sql('sp_data_v2', con=engine, if_exists = 'append', index = True, index_label = 'id')

In [118]:
engine.execute("SELECT * FROM sp_data_v2 LIMIT 15").fetchall()

[(0, '2000-01-03', 1469.25, 1478.0, 1438.359985, 1455.219971, 1455.219971, 931800000),
 (1, '2000-01-04', 1455.219971, 1455.219971, 1397.430054, 1399.420044, 1399.420044, 1009000000),
 (2, '2000-01-05', 1399.420044, 1413.27002, 1377.680054, 1402.109985, 1402.109985, 1085500000),
 (3, '2000-01-06', 1402.109985, 1411.900024, 1392.099976, 1403.449951, 1403.449951, 1092300000),
 (4, '2000-01-07', 1403.449951, 1441.469971, 1400.72998, 1441.469971, 1441.469971, 1225200000),
 (5, '2000-01-10', 1441.469971, 1464.359985, 1441.469971, 1457.599976, 1457.599976, 1064800000),
 (6, '2000-01-11', 1457.599976, 1458.660034, 1434.420044, 1438.560059, 1438.560059, 1014000000),
 (7, '2000-01-12', 1438.560059, 1442.599976, 1427.079956, 1432.25, 1432.25, 974600000),
 (8, '2000-01-13', 1432.25, 1454.199951, 1432.25, 1449.680054, 1449.680054, 1030400000),
 (9, '2000-01-14', 1449.680054, 1473.0, 1449.680054, 1465.150024, 1465.150024, 1085900000),
 (10, '2000-01-18', 1465.150024, 1465.150024, 1451.300049, 1455.140015, 1455.140015, 1056700000),
 (11, '2000-01-19', 1455.140015, 1461.390015, 1448.680054, 1455.900024, 1455.900024, 1087800000),
 (12, '2000-01-20', 1455.900024, 1465.709961, 1438.540039, 1445.569946, 1445.569946, 1100700000),
 (13, '2000-01-21', 1445.569946, 1453.180054, 1439.599976, 1441.359985, 1441.359985, 1209800000),
 (14, '2000-01-24', 1441.359985, 1454.089966, 1395.420044, 1401.530029, 1401.530029, 1115800000)]

In [119]:
pd.read_sql("SELECT * FROM sp_data_v2 ORDER BY date DESC LIMIT 15", con = conn).reset_index(drop = True)

,id,date,open,high,low,close,adj_close,volume
0,5098,2020-04-08,2685.000000,2760.750000,2663.300049,2749.979980,2749.979980,5856370000
1,5097,2020-04-07,2738.649902,2756.889893,2657.669922,2659.409912,2659.409912,7040720000
2,5096,2020-04-06,2578.280029,2676.850098,2574.570068,2663.679932,2663.679932,6391860000
3,5095,2020-04-03,2514.919922,2538.179932,2459.959961,2488.649902,2488.649902,6087190000
4,5094,2020-04-02,2458.540039,2533.219971,2455.790039,2526.899902,2526.899902,6454990000
5,5093,2020-04-01,2498.080078,2522.750000,2447.489990,2470.500000,2470.500000,5947900000
6,5092,2020-03-31,2614.689941,2641.389893,2571.149902,2584.590088,2584.590088,6568290000
7,5091,2020-03-30,2558.979980,2631.800049,2545.280029,2626.649902,2626.649902,5746220000
8,5090,2020-03-27,2555.870117,2615.909912,2520.020020,2541.469971,2541.469971,6194330000
9,5089,2020-03-26,2501.290039,2637.010010,2500.719971,2630.070068,2630.070068,7753160000
10,5088,2020-03-25,2457.770020,2571.419922,2407.530029,2475.560059,2475.560059,8285670000
11,5087,2020-03-24,2344.439941,2449.709961,2344.439941,2447.330078,2447.330078,7547350000
12,5086,2020-03-23,2290.709961,2300.729980,2191.860107,2237.399902,2237.399902,7402180000
13,5085,2020-03-20,2431.939941,2453.010010,2295.560059,2304.919922,2304.919922,9044690000
14,5084,2020-03-19,2393.479980,2466.969971,2319.780029,2409.389893,2409.389893,7946710000

In [93]:
session = Session(engine)

In [94]:
session.query(func.max(SP_Data_V2.date)).all()

[(datetime.date(2020, 4, 8))]

In [95]:
session.query(func.min(SP_Data_V2.date)).all()

[(datetime.date(2000, 1, 3))]